load-test/k6/results/test-2-for-30-min-ingestion-20-vus/insert-app_js_express_js.log

          /\      |‾‾| /‾‾/   /‾‾/
     /\  /  \     |  |/  /   /  /
    /  \/    \    |     (   /   ‾‾\ 
   /          \   |  |\  \ |  (‾)  |
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: ./scripts/insert-app.js
        output: dashboard http://127.0.0.1:5665

     scenarios: (100.00%) 1 scenario, 20 max VUs, 30m30s max duration (incl. graceful stop):
              * default: 20 looping VUs for 30m0s (gracefulStop: 30s)


     _js_express_js.................: avg=11.403492 min=3.294  med=11.126  max=271.584  p(90)=14.602  p(95)=15.887
     data_received..................: 861 MB  478 kB/s
     data_sent......................: 614 MB  341 kB/s
     http_req_blocked...............: avg=2.48µs    min=1µs    med=2µs     max=1.56ms   p(90)=3µs     p(95)=4µs
     http_req_connecting............: avg=247ns     min=0s     med=0s      max=685µs    p(90)=0s      p(95)=0s
     http_req_duration..............: avg=11.45ms   min=3.32ms med=11.17ms max=271.67ms p(90)=14.65ms p(95)=15.93ms
       { expected_response:true }...: avg=11.45ms   min=3.32ms med=11.17ms max=271.67ms p(90)=14.65ms p(95)=15.93ms
     http_req_failed................: 0.00%   ✓ 0          ✗ 3100385
     http_req_receiving.............: avg=37.39µs   min=13µs   med=34µs    max=18.67ms  p(90)=54µs    p(95)=63µs
     http_req_sending...............: avg=15.57µs   min=5µs    med=15µs    max=18.64ms  p(90)=21µs    p(95)=22µs
     http_req_tls_handshaking.......: avg=0s        min=0s     med=0s      max=0s       p(90)=0s      p(95)=0s
     http_req_waiting...............: avg=11.4ms    min=3.29ms med=11.12ms max=271.58ms p(90)=14.6ms  p(95)=15.88ms
     http_reqs......................: 3100385 1722.44452/s
     iteration_duration.............: avg=11.6ms    min=3.48ms med=11.32ms max=272.79ms p(90)=14.79ms p(95)=16.07ms
     iterations.....................: 3100385 1722.44452/s
     vus............................: 20      min=20       max=20
     vus_max........................: 20      min=20       max=20


running (30m00.0s), 00/20 VUs, 3100385 complete and 0 interrupted iterations
default ✓ [ 100% ] 20 VUs  30m0s